package andnot

/*
	Модуль тестирует элемент 2И-НЕ
*/

import (
	мТест "testing"
)

var (
	_2ине *Т2Ине
)

func Test2Или(тест *мТест.T) {
	_Создать := func() {
		if _2ине = Нов2Ине(); _2ине == nil {
			тест.Errorf("_Создать(): ОШИБКА 2ине не может быть nil\n")
		}
	}
	_Или := func(п1, п2 int8) {
		_2ине.Уст(п1, п2)
		if п1 == 1 && п2 == 1 {
			if _2ине.Получ() != 0 {
				тест.Errorf("_Или(): ОШИБКА 2ине не равно 0\n")
			}
		} else {
			if _2ине.Получ() != 1 {
				тест.Errorf("_Или(): ОШИБКА 2ине не равно 1\n")
			}
		}
	}
	_Создать()
	_Или(0, 0)
	_Или(1, 0)
	_Или(0, 1)
	_Или(1, 1)
}
